<?php
	
	echo "<h2>Массив книг:</h2>";
	$books = array(
		"Рей Бредбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
        "Грегори Девид Робинсон" => ["Шантарам", "Тень горы"],
		"Джорж Оруэлл" => "1984", 
		"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
        "Эрих Мария Ремарк" => "Три товарища",
		"Оскар Уайльд" => "Портрет Дориана Грея", 
		"Даниель Киз" => "Цветы для Элджернона",
		"Джером Д Сэлинджер" => "Над пропастью во ржи",
        "Антуан де Сент-Экзюпери" => "Маленький принц",
		"Лев Толстой" => "Анна Каренина",
		"Габриель Гарсиа Маржес" => "Сто лет одиночества",
		"Айн Рэнд" => "Атлант расправил плечи"
	);
	
//Цикл для обхода массива
	echo "<ol>";
    foreach ($books as $bookAuthor => $bookTitle) {
        
        if ( is_array($bookTitle) ) {
            echo "<li>$bookAuthor:";
               echo "<ol>";
            
            foreach ($bookTitle as $book) {
                echo "<li>$book</li>";
            }
               echo "</ol>";
            echo "</li>";
        } else {
            echo "<li> $bookAuthor: $bookTitle </li>";
        }
    } 
	

    

	echo "<h2>Массив фильмов:</h2>";
	$films = array("Пролетая над гнездом кукшки", "Сила воли", "Одаренная", "Помни", "Начало");
	//Цикл для обхода массива
	echo "<ol>";
	for ($i = 0; $i < count($films); $i++) { 
		echo "<li> $films[$i] </li>";
	}
	echo "</ol>";
?>